{
    "courtyard_statue": {
        "name": "STATUE",
        "location": "courtyard",
        "description": "A statue of the wizard Zandar towers over you in the centre of the courtyard.",
        "lookDescription": [
            "The huge statue of Zandar must measure ten meters tall at least, his arms splayed wide, gown blowing in an eternal gale, staff in one hand, open grimoire in the other, as he shouts to the heavens. He is an imposing figure, slight though he is, with sharp features and a long, narrow beard that reaches down to his sternum.",
            "",
            "Time has buffeted the statue, it's surfaces are thick with moss, vines climbing its cracked exterior"
        ],
        "isGrabbable": false,
        "isActive": true,
        "look": {
        }
    },
    "courtyard_iron_door": {
        "name": "IRON DOOR",
        "location": "courtyard",
        "description": "An iron door with an intricate keyhole blocks your path to the north.",
        "isGrabbable": false,
        "isDoor": true,
        "isActive": true,
        "look": {}
    },
    "courtyard_skeleton": {
        "name": "SKELETON",
        "location": "courtyard",
        "description": "A skeleton is slumped against the base of a statue.",
        "lookDescription": [
            "The skeleton lies slumped against the base of the statue. It is ancient and yellowed, moss clinging to the bones. Shreds of clothing, bleached by the sun, flutter in the breeze.",
            "Rotten arrows are still buried in it's ribcage, a cleft hewn in the top of its skull tells of this adventurer's demise. You wonder if this is also the fate that awaits you?",
            "The skeleton's fleshless fingers are wrapped around what appears to be a 'iron key'. It is large and heavy with an incredibly intricate tip."
        ],
        "isGrabbable": false,
        "isActive": true,
        "look": {
            "mutations": [
                {
                    "target": "courtyard_key",
                    "actions": [
                        {
                            "property": "isActive",
                            "action": "set",
                            "value": true
                        },
                        {
                            "property": "isGrabbable",
                            "action": "set",
                            "value": true
                        }
                    ]
                }
            ]
        }
    },
    "courtyard_key": {
        "name": "IRON KEY",
        "location": "courtyard",
        "lookDescription": [
            "An iron key, ancient and rusty is wrapped in the skeleton's hand. It's surface is worn and pitted. There seems to be dried blood smeared on the handle."
        ],
        "description": "An iron key is clenched in the skeleton's bony fingers.",
        "isGrabbable": false,
        "destroyOnUse": true,
        "used": false,
        "isActive": false,
        "take": {
            "description": [
                "You prize open the skeleton's fingers which requires a surprising amount of force as though, even in death, the cadaver remembers the importance of this item.",
                "As you peel open the hand the skeleton crumbles as if finally defeated. You are left with nothing but the heavy iron key, which you place in your backpack"
            ],
            "mutations": [
                {
                    "target": "courtyard_skeleton",
                    "actions": [
                        {
                            "property": "lookDescription",
                            "action": "set",
                            "value": "A pile of mossy bones lies scattered where this adventurer once lay."
                        },
                        {
                            "property": "description",
                            "action": "set",
                            "value": "A pile of mossy bones lies scattered where a skeleton once lay."
                        }
                    ]
                },
                {
                    "target": "courtyard_key",
                    "actions": [
                        {
                            "property": "lookDescription",
                            "action": "set",
                            "value": [
                                "A heavy iron key, it's surface is pitted and ancient. It seems intricate beyond the capabilities of the material.",
                                "Brown stains that look like smeared blood are caked on the surface. This item has a storied history."
                            ]
                        }
                    ]
                }
            ]
        },
        "use": {
            "subject": "courtyard_iron_door",
            "description": [
                "You push the key into the lock and turn it. Within the bowels of the labryinth you can hear ancient mechanisms creak into life.",
                "With a screech like nails down a blackboard the heavy iron door slowly swings open."
            ],
            "mutations": [
                {
                    "target":"courtyard_iron_door",
                    "actions": [ 
                        {
                            "property": "isActive",
                            "action": "set",
                            "value": false
                        }
                    ]
                }
            ]
        }
    }
}